УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ВидыПутейСообщений/КонтурЛогистика_ВидыПутейСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыПутейСообщений</name>
  <comment>Сведения о виде сообщения (добавили ПУТЕЙ чтоб случайно не отнести к нашим xml сообщениям)</comment>
  <enumValues>
    <name>Г</name>
  </enumValues>
  <enumValues>
    <name>П</name>
  </enumValues>
  <enumValues>
    <name>М</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ВидыПутейСообщений/ManagerModule.bsl
Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= Г Тогда 
		Результат = "Г";
	ИначеЕсли Ссылка= П Тогда 
		Результат = "П";
	ИначеЕсли Ссылка= М Тогда 
		Результат = "М";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Вида путей сообщения: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка= "Г" Тогда 
		Результат = Г;
	ИначеЕсли Строка= "П" Тогда 
		Результат = П;
	ИначеЕсли Строка= "М" Тогда 
		Результат = М;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
